#!/bin/bash
#
red='\e[91m'
green='\e[92m'
yellow='\e[93m'
magenta='\e[95m'
cyan='\e[96m'
none='\e[0m'
time=date
#
# Root
echo -e "${green}###############################################################################"
echo -e "${green}开始校对系统时间 ${red} 正在校时中.........  ${green} 请稍候! ${yellow}~(^_^) ${none} "
echo -e "${green}###############################################################################\n"
ntpd -n -d -q -p 203.107.6.88
#ntpd -n -d -q -p 223.113.97.98
#ntpd -n -d -q -p 119.29.26.206
#ntpd -n -d -q -p 2001:da8:9000::81
echo -e "${green}###############################################################################"
echo -e "${yellow}" && date  "+现在时间是： %Y-%m-%d %H:%M:%S"
echo -e "${green}系统时间已校对成功！${green} 可以输入${red}date${green}命令查看当前时间"
echo -e "${green}\n###############################################################################"
exit 1
